/****设置客户端连接服务器使用UTF8编码****/
SET NAMES UTF8;
/****如果数据库yz存在的话，就删除****/
DROP DATABASE IF EXISTS yz;
/****重新创建数据库yz，使用UTF8编码****/
CREATE DATABASE yz CHARSET=UTF8;
/****进入数据库yz****/
USE yz;

/*用户信息表yz_user*/
CREATE TABLE yz_user(
  uid INT PRIMARY KEY AUTO_INCREMENT,   #用户编号
  uname VARCHAR(32),                    #用户名
  upwd VARCHAR(32),                     #密码
  email VARCHAR(64),                    #邮箱
  phone VARCHAR(16),                    #电话
  avatar VARCHAR(128),                  #头像图片路径
  gender INT                            #性别  0-女  1-男
);
INSERT INTO yz_user VALUES
(NULL, 'luguoping', '123456', '879101403@qq.com', '15379889318', 'img/avatar/02.jpg','0'),
(NULL, 'doudou', '123456', 'dou@qq.com', '13501234569', 'img/avatar/03.jpg','1'),
(NULL, 'yaya', '123456', 'ya@qq.com', '13501234560', 'img/avatar/01.jpg','0');

/*创建首页轮播广告表 yz_index_carousel*/
CREATE TABLE yz_index_carousel(
  cid INT PRIMARY KEY AUTO_INCREMENT,   #轮播广告编号
  img VARCHAR(128),                     #图片路径
  title VARCHAR(64),                    #主题
  href VARCHAR(128)                     #图片链接路径
);
INSERT INTO yz_index_carousel VALUES
(NULL, 'img/index/banner1.jpg','8号璀璨桂花慕思蛋糕','detail.html?fid=1&pid=2&aid=3'),
(NULL, 'img/index/banner2.jpg','专款蛋糕','product.html?fid=1&pid=2'),
(NULL, 'img/index/banner3.jpg','澳柑礼盒','detail.html?fid=4&pid=1&aid=1'),
(NULL, 'img/index/banner4.jpg','冰淇淋蛋糕','product.html?fid=2&pid=2'),
(NULL, 'img/index/banner5.jpg','蛋黄酥礼盒','detail.html?fid=4&pid=2*aid=8');

/*元祖产品分类表 yz_family*/
CREATE TABLE yz_family(
  fid INT PRIMARY KEY AUTO_INCREMENT,    #分类编号
  fname VARCHAR(32)                      #分类名称
);
INSERT INTO yz_family VALUES
(null,'元祖桂花季'),
(null,'冰品季'),
(null,'MUCH蛋糕'),
(null,'元祖礼盒'),
(null,'精致西点'),
(null,'元祖卡劵');

/*中秋节板块表 yz_plate_guihua*/
CREATE TABLE yz_plate_guihua{
  pid INT PRIMARY KEY AUTO_INCREMENT,   #板块编号
  pname VARCHAR(32)											#板块名称
}
INSERT INTO yz_plate_guihua VALUES
(null,'季节限定'),
(null,'专款蛋糕');

/*冰品季板块表 yz_plate_bingpin*/
CREATE TABLE yz_plate_bingpin{
  pid INT PRIMARY KEY AUTO_INCREMENT,   #板块编号
  pname VARCHAR(32)											#板块名称
}
INSERT INTO yz_plate_bingpin VALUES
(null,'冰品点心'),
(null,'冰淇淋蛋糕');

/*MUCH蛋糕板块表 yz_plate_dangao*/
CREATE TABLE yz_plate_dangao{
  pid INT PRIMARY KEY AUTO_INCREMENT,   #板块编号
  pname VARCHAR(32)											#板块名称
}
INSERT INTO yz_plate_dangao VALUES
(null,'鲜奶蛋糕'),
(null,'巧克力蛋糕'),
(null,'慕斯蛋糕'),
(null,'多层蛋糕');

/*元祖礼盒板块 yz_plate_lihe*/
CREATE TABLE yz_plate_lihe{
  pid INT PRIMARY KEY AUTO_INCREMENT,   #板块编号
  pname VARCHAR(32)											#板块名称
}
INSERT INTO yz_plate_lihe VALUES
(null,'水果礼盒'),
(null,'糕点礼盒');

/*精致西点板块 yz_plate_xidian*/
CREATE TABLE yz_plate_xidian{
  pid INT PRIMARY KEY AUTO_INCREMENT,   #板块编号
  pname VARCHAR(32)											#板块名称
}
INSERT INTO yz_plate_xidian VALUES
(null,'小慕斯类'),
(null,'西点卷类'),
(null,'麻糬类'),
(null,'其他');

/*元祖卡券板块表 yz_plate_kaquan*/
CREATE TABLE yz_plate_kaquan{
  pid INT PRIMARY KEY AUTO_INCREMENT,   #板块编号
  pname VARCHAR(32)											#板块名称
}
INSERT INTO yz_plate_kaquan VALUES
(null,'卡礼'),
(null,'水果劵'),
(null,'西点券'),
(null,'蛋糕券'),
(null,'电子券');

/*元祖商品表 yz_product*/
CREATE TABLE yz_product(
  aid INT PRIMARY KEY AUTO_INCREMENT,    #商品列表编号
  lid INT,                               #商品编号
  fid INT,                               #所属分类编号
  pid INT,                               #所属板块编号
  title VARCHAR(128),                    #主标题
  subtitle VARCHAR(128),                 #副标题
  price DECIMAL(10,2),                   #价格
  promise VARCHAR(64),                   #服务承诺
  spec VARCHAR(64),                      #规格
  cake VARCHAR(64),                      #蛋糕夹层
);
INSERT INTO yz_product VALUES
/*商品编号lid，分类编号fid，板块编号pid*/
(null,100001,1,1,'桂花酥（5人）','桂花酥、贵花酥','50','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100002,1,1,'小方慕思（桂花味）','淡淡的桂花香，久留于口','20','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100003,1,2,'8号粉桂初开鲜奶蛋糕','忙碌生活中品尝秋季的美味','218','  精选食材  品质保证   五星服务  贴心宅配','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100004,1,2,'8号桂花精灵鲜奶蛋糕','贵花精灵，为您献上属于秋天的一支舞','218','  精选食材  品质保证   五星服务  贴心宅配','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100005,1,2,'8号璀璨桂花慕思蛋糕','一朵美丽又好吃的“花”','288','  精选食材  品质保证   五星服务  贴心宅配'),

(null,100006,2,1,'雪麻糬','糯米拥抱冰淇淋','15','  精选食材  品质保证   五星服务  贴心宅配','草莓味、 芒果味、 蓝莓味'),
(null,100007,2,1,'铜锣烧冰淇淋','冰凉美味，满足味蕾','12','  精选食材  品质保证   五星服务  贴心宅配','红豆抹茶味、 红豆牛奶味'),
(null,100008,2,2,'倾心雪域冰淇淋蛋糕','幸福、甜蜜、快乐、微笑','260','  精选食材  品质保证   五星服务  贴心宅配','6号、8号'),
(null,100009,2,2,'莓丽春心冰淇淋蛋糕','在热的夏天 也要保有春心','260','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号'),
(null,100010,2,2,'8号心心相印冰淇淋蛋糕','330','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100011,2,2,'倾情美利坚冰淇淋蛋糕','清凉一夏 盛夏粉味登场','260','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号'),
(null,100012,2,2,'粉红心情冰淇淋蛋糕','恋爱的味道，粉色的心情','260','  精选食材  品质保证   五星服务  贴心宅配','6号、8号'),
(null,100013,2,2,'酷爽花儿冰淇淋蛋糕','层层棉花糖，吃在嘴里，甜在心里','260','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号'),

(null,100014,3,1,'爱的种子鲜奶蛋糕','风雨来袭，烈阳初照，阻挡不了种子发芽，爱无价','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号、12号、14号(提前7天预订)、16号(提前7天预订)','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100015,3,1,'情有独钟鲜奶蛋糕','远古留下的爱情传说，四颗红心，双双牵绊，凝聚在崖壁之上。','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100016,3,1,'6号旺事如意鲜奶蛋糕','2018 万事兴旺','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100017,3,1,'纯净香遇鲜奶蛋糕','遇见一个人在最美好的时代','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号、12号、14号(提前7天预订)、16号(提前7天预订)','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100018,3,1,'幸福花园鲜奶蛋糕','一座小花园，一场优美的幸福','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100019,3,1,'缤纷贝蒂鲜奶蛋糕','彩蝶纷飞，缤纷多姿的花园，和风暖熏','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号、12号、14号(提前7天预订)、16号(提前7天预订)','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100020,3,1,'花苑然然鲜奶蛋糕','朵朵含苞欲放的玫瑰','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号、12号、14号(提前7天预订)、16号(提前7天预订)','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100021,3,1,'田园晓美鲜奶蛋糕','田园风光，一览无余，晨晓','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100022,3,1,'青春时光鲜奶蛋糕','那些年的青春，你还记得吗？','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100023,3,1,'以花为名鲜奶蛋糕','让“世界上第一个挺你的妈妈”，成为幸福的妈妈','218','  精选食材  品质保证   五星服务  贴心宅配','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100024,3,1,'阿祖萌熊鲜奶蛋糕','看见萌熊在微笑，么么哒~','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100025,3,1,'甜蜜如心鲜奶蛋糕','牵手的甜蜜，相伴的甜蜜，心与心依偎。','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100026,3,1,'果嘉年华鲜奶蛋糕','日本枯山水，移植方寸之间，摆上水果，一场嘉年华','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号、12号、14号(提前7天预订)、16号(提前7天预订)','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100027,3,1,'蝶恋花景鲜奶蛋糕','一只凤蝶，飞过千山，一段爱情，千古流传。','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100028,3,1,'我的歌声里鲜奶蛋糕','听懂歌声，便听懂了世界','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100029,3,1,'蟠桃献颂祝寿鲜奶蛋糕','用晚辈的孝心换取长辈的开心','218','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号、12号、14号(提前7天预订)、16号(提前7天预订)','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100030,3,1,'蟠桃献寿鲜奶蛋糕','尊敬长辈！晚辈献上满满的祝福','218','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号、12号、14号(提前7天预订)、16号(提前7天预订)','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100031,3,1,'水果之恋鲜奶蛋糕','当黄桃簇拥樱桃，一段爱情正在发生','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号、12号、14号(提前7天预订)、16号(提前7天预订)','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100032,3,1,'Nice兔meetyou鲜奶蛋糕','她微笑迎接每天的日出，生活永远快乐着','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100033,3,1,'黄金燕麦鲜奶蛋糕','金黄的燕麦田，一间木屋摇篮里，吹出夕阳的笛声','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100033,3,2,'雪漫飞舞克力蛋糕','哥本哈根的初雪，落下肖邦的音符','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100034,3,2,'LOVE ME克力蛋糕','爱，是我用心为你描绘的世界','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100035,3,2,'莫尔卡夫克力蛋糕','夕阳倒影湖面，水波粼粼','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100036,3,2,'福鸟咕咕宝巧克力蛋糕','福鸡到，吉利到','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100037,3,2,'单纯的心克力蛋糕','坚果铺就的海滨之路，通往宁静的小岛','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100038,3,2,'夏日之恋巧克力蛋糕','巧克力的沙滩，密林里一抹风情','158','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100039,3,3,'柳橙慕思蛋糕','柳橙香，热带丛林狂欢的篝火。','288','  精选食材  品质保证   五星服务  贴心宅配','8号'),
(null,100040,3,3,'蓝莓慕思蛋糕','为健康加分，下午时光的好伴侣','188','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号'),
(null,100041,3,3,'清风有信慕思蛋糕','摇动树叶如铃，在盛夏的午后，清风送来一封信','188','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号'),
(null,100042,3,3,'香芒飘飘慕思蛋糕','芒果阵阵清香，口口饱满','188','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号'),
(null,100043,3,3,'恋爱的心慕思蛋糕','樱桃成双，高山为证，恋爱的沙滩，阳光','188','  精选食材  品质保证   五星服务  贴心宅配','6号、 8号、10号'),
(null,100044,3,3,'香蕉慕思蛋糕','288','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100045,3,3,'芝士不凡芝士布朗尼慕思蛋糕','奶酪的香醇，巧克力的微苦，一个乐队即将演奏','288','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100046,3,4,'前程似锦鲜奶蛋糕','紫玫瑰的浪漫与真情，在雪地里拥抱未来','1040','  精选食材  品质保证   五星服务  贴心宅配','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100047,3,4,'爱相随鲜奶蛋糕','矮矮篱笆墙，云蝶翩翩飞，如果爱如磐石，一定是彼此相随','1140','  精选食材  品质保证   五星服务  贴心宅配','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100048,3,4,'粉色恋曲鲜奶蛋糕','黄玫瑰与粉玫瑰，活力与纯真。','800','  精选食材  品质保证   五星服务  贴心宅配','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100049,3,4,'玫瑰热恋鲜奶蛋糕','一朵玫瑰，一份执守。相爱予狂风，相伴予暖阳','660','  精选食材  品质保证   五星服务  贴心宅配','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100050,3,4,'连枝并头鲜奶蛋糕','走到了婚姻殿堂，一定是最爱的才在一起','1140','  精选食材  品质保证   五星服务  贴心宅配','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100051,3,4,'天亦有情鲜奶蛋糕','送给婚礼的祝福，三生三世情缘','1140','  精选食材  品质保证   五星服务  贴心宅配','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),
(null,100052,3,4,'百寿延绵鲜奶蛋糕','岁月留下鲜花的晚香，寿星在祝福声中容颜不老。。。','1040','  精选食材  品质保证   五星服务  贴心宅配','香芋+香芋（网红款） 水果+布丁 布丁+香芋 布丁+燕麦 水果+香芋 水果+燕麦 香芋+燕麦'),

(null,100053,4,1,'澳柑礼盒','沐浴澳洲阳光长大的柑橘','168','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100054,4,1,'台湾柚','果实香味浓郁，果肉汁液清甜','168','  精选食材  品质保证   五星服务  贴心宅配','4人、6人'),
(null,100055,4,2,'坚果礼盒','巴旦木，黑芝麻。高山与田园两只清隽古调','98','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100056,4,2,'绿豆糕礼盒','炎炎夏日，吹来一股凉风','98','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100057,4,2,'乌龙茶礼盒','每一片茶叶的挑选，每一杯好茶的历练','248','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100058,4,2,'2人蛋生报喜礼盒','弥月不迟，礼赠新生。','28','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100059,4,2,'牛轧礼盒','童年时，有个好朋友，她叫牛轧糖','80','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100060,4,2,'咖啡礼盒(5人)','停下来，享受生活','58','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100061,4,2,'6人蛋生报喜礼盒','弥月不迟，礼赠新生。','68','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100062,4,2,'蛋黄酥礼盒','120','  精选食材  品质保证   五星服务  贴心宅配','香芋味*2条+枣泥味*1条 枣泥味*2条+香芋味*1条'),
(null,100063,4,2,'幸福结果子礼盒','一款不可多得的伴手礼','60','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100064,4,2,'幸福御果子礼盒','一款不可多得的伴手礼','54','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100065,4,2,'元祖旺来凤梨酥','一款不可多得的伴手礼','128','  精选食材  品质保证   五星服务  贴心宅配'),

(null,100066,5,1,'三角慕思','三点一刻，最期待的享受。','22','  精选食材  品质保证   五星服务  贴心宅配','抹茶红豆味、柳橙味、草莓味、巧克力味'),
(null,100067,5,1,'小方慕思草莓味','三点一刻，最期待的享受。','20','  精选食材  品质保证   五星服务  贴心宅配','乳酪味、草莓味'),
(null,100068,5,1,'三角cheese cake','让您充分体验奶酪的至尊享受','22','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100069,5,2,'桂圆核桃糕','10','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100070,5,2,'西点卷','卷起来的幸福','10','  精选食材  品质保证   五星服务  贴心宅配','咖啡卷、 肉松卷、 虎皮卷、 香槟葡萄卷、 抹茶红豆卷、 草莓卷'),
(null,100071,5,3,'麻糬','Q糯的外表下，很有内涵。','10','  精选食材  品质保证   五星服务  贴心宅配','枣泥味、 花生味、 芝麻味'),
(null,100072,5,4,'元祖核桃酥','儿时久违的味道','10','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100073,5,4,'红蛋','8','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100074,5,4,'蜂蜜蛋糕','11','  精选食材  品质保证   五星服务  贴心宅配','抹茶口味、 原味'),
(null,100075,5,4,'烤福条','10','  精选食材  品质保证   五星服务  贴心宅配','蔓越莓口味、 榛果味'),
(null,100076,5,4,'优酪球巧克力','奶酪邂逅提子，浓香酸甜的满足感','10','  精选食材  品质保证   五星服务  贴心宅配'),

(null,100077,6,1,'1000型心意卡','一卡在手，跨地通提','1000','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100078,6,1,'500型心意卡','一卡在手，跨地通提','500','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100079,6,1,'元祖300型心意卡','一卡在手，跨地通提','300','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100080,6,1,'200型心意卡','一卡在手，跨地通提','200','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100081,6,1,'100型心意卡','一卡在手，跨地通提','100','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100082,6,2,'168型水果提货券','一券在手，多种款式，任君挑选','168','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100083,6,3,'100型西点券','一券在手，多种款式，任君挑选','100','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100084,6,3,'20型西点券','一券在手，多种款式，任君挑选','20','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100085,6,3,'50型西点券','一券在手，多种款式，任君挑选','50','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100086,6,3,'10型西点券','一券在手，多种款式，任君挑选','10','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100087,6,3,'2018绿豆糕提货券','一券在手，跨地通提','98','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100088,6,3,'绿豆糕电子提货券','可提领绿豆糕礼盒 提领截止至2021年12月31日 19：00止','98','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100089,6,4,'218型蛋糕券','218','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100090,6,4,'288型蛋糕券','288','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100091,6,4,'15型蛋糕券','158','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100092,6,5,'16号鲜奶蛋糕电子券','每笔订单限购10张电子券。提领16号鲜奶/巧克力蛋糕,自购买日起1年内有效','568','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100093,6,5,'14号鲜奶蛋糕电子券','每笔订单限购10张电子券。提领14号鲜奶/巧克力蛋糕,自购买日起1年内有效','468','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100094,6,5,'10号鲜奶蛋糕电子券','每笔订单限购10张电子券。提领10号鲜奶/巧克力蛋糕,自购买日起1年内有效','288','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100095,6,5,'10号慕思蛋糕电子券','每笔订单限购10张电子券。提领10号慕思蛋糕,自购买日起1年内有效','358','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100096,6,5,'6号慕思蛋糕电子券','每笔订单限购10张电子券。提领6号慕思蛋糕,自购买日起1年内有效','188','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100097,6,5,'100型西点电子券','每笔订单限购10张电子券。面值100元，提领西点、礼盒、蛋糕（不含端午粽子、中秋月饼、年糕）,自购买日起1年内','100','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100098,6,5,'20型西点电子券','每笔订单限购10张电子券。面值20元，提领西点、礼盒、蛋糕（不含端午粽子、中秋月饼、年糕） ,自购买日起1年内有','20','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100099,6,5,'12号鲜奶蛋糕电子券','每笔订单限购10张电子券 。提领12号鲜奶/巧克力蛋糕,自购买日起1年内有效','358','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100100,6,5,'6号鲜奶蛋糕电子券','每笔订单限购10张。电子券提领6号鲜奶/巧克力蛋糕,自购买日起1年内有效','158','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100101,6,5,'168型水果电子券','提领168元的水果礼盒,自购买日起1年内有效','168','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100102,6,5,'8号鲜奶蛋糕电子券','每笔订单限购10张电子券。提领8号鲜奶/巧克力蛋糕,自购买日起1年内有效','218','  精选食材  品质保证   五星服务  贴心宅配'),
(null,100103,6,5,'50型西点电子券','每笔订单限购10张电子券。面值50元，提领西点、礼盒、蛋糕（不含端午粽子、中秋月饼、年糕）,自购买日起1年内有','50','  精选食材  品质保证   五星服务  贴心宅配');

/*创建首页商品表 yz_index_product*/
CREATE TABLE yz_index_product(
  tid INT PRIMARY KEY AUTO_INCREMENT,  #楼梯编号
  title VARCHAR(64),                   #标题
  subtitle VARCHAR(128),               #副标题
  pic VARCHAR(128),                    #图片
  price DECIMAL(10,2),                 #价格
  href VARCHAR(128),                   #链接路径
);
INSERT INTO yz_index_product VALUES
(NULL,'img/index/notice.jpg','details.html?lid=100004'),

(NULL,'img/index/floor2.jpg','details.html?lid=100001'),
-- 元祖新品
(NULL,'桂花酥（5人）','img/index/floor2-1-1.jpg',50,'details.html?lid=100001'),
(NULL,'8号璀璨桂花慕思蛋糕','img/index/floor2-1-2_floor3-1.jpg',288,'details.html?lid=100005'),
(NULL,'小方慕思（桂花味）','img/index/floor2-1-3.jpg',20,'details.html?lid=100002'),
(NULL,'8号桂花精灵鲜奶蛋糕','img/index/floor2-1-4_floor3-3.jpg',218,'details.html?lid=100004'),
-- 热销推荐
(NULL,'8号心心相印冰淇淋蛋糕','img/index/floor2-2-1.jpg',330,'details.html?lid=100010'),
(NULL,'粉红心情冰淇淋蛋糕','img/index/floor2-2-2.jpg',330,'details.html?lid=100012'),
(NULL,'倾情美利坚冰淇淋蛋糕','img/index/floor2-2-3.jpg',330,'details.html?lid=100011'),
(NULL,'酷爽花儿冰淇淋蛋糕','img/index/floor2-2-4.jpg',330,'details.html?lid=100013'),
-- 节庆民俗
(NULL,'元祖旺来凤梨酥','img/index/floor2-3-1_floor4-3.jpg',128,'details.html?lid=100065'),
(NULL,'坚果礼盒','img/index/floor2-3-2.jpg',98,'details.html?lid=100055'),
(NULL,'幸福结果子礼盒','img/index/floor2-3-3.jpg',60,'details.html?lid=100063'),
(NULL,'绿豆糕礼盒','img/index/floor2-3-4.jpg',60,'details.html?lid=100056'),
-- 元祖卡卷
(NULL,'100型心意卡','img/index/floor2-4-1.jpg',100,'details.html?lid=100081'),
(NULL,'200型心意卡','img/index/floor2-4-2.jpg',200,'details.html?lid=100080'),
(NULL,'元祖300型心意卡','img/index/floor2-4-3.jpg',300,'details.html?lid=100079'),
(NULL,'500型心意卡','img/index/floor2-4-4.jpg',500,'details.html?lid=100078'),
-- 蛋糕
(NULL,'img/index/floor3.jpg','product.html?fid=3'),
(NULL,'8号璀璨桂花慕思蛋糕','一朵美丽又好吃的“花”','img/index/floor2-1-2_floor3-1.jpg',288,'details.html?lid=100005'),
(NULL,'8号粉桂初开鲜奶蛋糕','忙碌生活中品尝秋季的美味','img/index/floor2-4-4.jpg',218,'details.html?lid=100003'),
(NULL,'8号桂花精灵鲜奶蛋糕','贵花精灵，为您献上属于秋天的一支舞','img/index/floor2-1-4_floor3-3.jpg',218,'details.html?lid=100004'),
-- 礼盒
(NULL,'img/index/floor4.jpg','product.html?fid=4'),
(NULL,'咖啡礼盒','停下来，享受生活','img/index/floor4-1.jpg',58,'details.html?lid=100060'),
(NULL,'幸福御果子礼盒','一款不可多得的伴手礼','img/index/floor4-2.jpg',54,'details.html?lid=100064'),
(NULL,'元祖旺来凤梨酥','一款不可多得的伴手礼','img/index/floor2-3-1_floor4-3.jpg',128,'details.html?lid=100065'),
-- 西点
(NULL,'img/index/floor5.jpg','product.html?fid=5'),
(NULL,'麻糬枣泥味','Q糯的外表下，很有内涵','img/index/floor5-1.jpg',10,'details.html?lid=100071'),
(NULL,'蜂蜜蛋糕','img/index/floor5-2.jpg',11,'details.html?lid=100074'),
(NULL,'小方慕思草莓味','三点一刻，最期待的享受','img/index/floor5-3.jpg',20,'details.html?lid=100067'),
-- 活动
(NULL,'img/index/floor6-1.jpg','details.html?lid=100025'),
(NULL,'img/index/floor6-2.jpg','details.html?lid=100056'),
(NULL,'img/index/floor6-3.jpg','details.html?lid=100034');